#### ✅ Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-07T08:50:06Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base



Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to OpenTofu
- Reusing previous version of rackerlabs/spot from the dependency lock file
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
spot_cloudspace.this: Refreshing state... [id=mp-runners-v3]
spot_spotnodepool.this: Refreshing state... [id=6541cf55-a113-46e0-ab4a-7fc260c68eaa]
terraform_data.wait_for_cluster: Refreshing state... [id=2d3cc119-3b9d-fefd-8944-c9cc6d7cd0b1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.spot_kubeconfig.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "spot_kubeconfig" "this" {
      + cloudspace_name = "mp-runners-v3"
      + id              = (known after apply)
      + kubeconfigs     = (known after apply)
      + raw             = (known after apply)
    }

  # terraform_data.wait_for_cluster is tainted, so it must be replaced
-/+ resource "terraform_data" "wait_for_cluster" {
      ~ id               = "2d3cc119-3b9d-fefd-8944-c9cc6d7cd0b1" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cluster_ca_certificate = (sensitive value)
  + cluster_endpoint       = (known after apply)
  + cluster_token          = (sensitive value)
  + kubeconfig_raw         = (sensitive value)

Warning: Deprecated attribute

  on main.tf line 72, in resource "terraform_data" "wait_for_cluster":
  72:   triggers_replace = [spot_cloudspace.this.id]

The attribute "id" is deprecated. Refer to the provider documentation for
details.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/kubernetes v3.0.1...
- Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/helm v3.1.1...
- Installed hashicorp/helm v3.1.1 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 600
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                "dex":
                  "enabled": false
                "repoServer":
                  "replicas": 1
                "server":
                  "service":
                    "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace_v1.argocd will be created
  + resource "kubernetes_namespace_v1" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + argocd_chart_version = "5.51.6"
  + argocd_namespace     = "argocd"
  + argocd_release_name  = "argocd"
  + cluster_endpoint     = "https://mock-endpoint.example.com"

Invalid attribute in provider configuration

  with provider["registry.opentofu.org/hashicorp/kubernetes"],
  on main.tf line 23, in provider "kubernetes":
  23: provider "kubernetes" {

'cluster_ca_certificate' is not a valid PEM encoded certificate

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```
</details>